In [20]:
f = open("text.txt", 'r')

print(f.read(3)) #Read 3 characters
f.seek(1) #Control cursor
print(f.read(3)) #Read 3 characters
print(f.read()) #Read the rest of characters


f.close()

abcdefghijklmnop

In [45]:
f = open("my_data.csv", "r")
data = f.readlines()

f.close()
data

['name,score,attempts,qualify,Success\n',
 'Anastasia,12.5,1,yes,1\n',
 'Dima,9.0,3,no,0\n',
 'Katherine,16.5,2,yes,1\n',
 'James,,3,no,0\n',
 'Emily,9.0,2,no,0\n',
 'Michael,20.0,3,yes,1\n',
 'Matthew,14.5,1,yes,1\n',
 'Laura,,1,no,0\n',
 'Kevin,8.0,2,no,0\n',
 'Jonas,19.0,1,yes,1\n',
 'Suresh,15.5,1,yes,1\n']

In [46]:
import pandas as pd
data = [row.strip().split(',') for row in data]
header = data.pop(0)
pd.DataFrame(data, columns=header)

         name score attempts qualify Success
0   Anastasia  12.5        1     yes       1
1        Dima   9.0        3      no       0
2   Katherine  16.5        2     yes       1
3       James              3      no       0
4       Emily   9.0        2      no       0
5     Michael  20.0        3     yes       1
6     Matthew  14.5        1     yes       1
7       Laura              1      no       0
8       Kevin   8.0        2      no       0
9       Jonas  19.0        1     yes       1
10     Suresh  15.5        1     yes       1

In [47]:
pd.read_csv("my_data.csv")

         name  score  attempts qualify  Success
0   Anastasia   12.5         1     yes        1
1        Dima    9.0         3      no        0
2   Katherine   16.5         2     yes        1
3       James    NaN         3      no        0
4       Emily    9.0         2      no        0
5     Michael   20.0         3     yes        1
6     Matthew   14.5         1     yes        1
7       Laura    NaN         1      no        0
8       Kevin    8.0         2      no        0
9       Jonas   19.0         1     yes        1
10     Suresh   15.5         1     yes        1

In [34]:
"     Mohamed Mohamed     \n ".strip() #Remove spaces from beginning and end

'Mohamed Mohamed'

In [42]:
X = [1, 2, 3, 4, 5]
X.pop(1)

2

In [50]:
with open("my_data.csv", "r") as f:
    print(f.readline())
    print(f.readline())
    withdata = f.readlines()
    
withdata

name,score,attempts,qualify,Success

Anastasia,12.5,1,yes,1

['Dima,9.0,3,no,0\n',
 'Katherine,16.5,2,yes,1\n',
 'James,,3,no,0\n',
 'Emily,9.0,2,no,0\n',
 'Michael,20.0,3,yes,1\n',
 'Matthew,14.5,1,yes,1\n',
 'Laura,,1,no,0\n',
 'Kevin,8.0,2,no,0\n',
 'Jonas,19.0,1,yes,1\n',
 'Suresh,15.5,1,yes,1\n']

In [55]:
import os
os.remove('text.txt')